Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.MemberAxislocation Property
 Gets or sets the axis location of the members.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModel.AxisLocationEnum MemberAxislocation { get; set; }
Public Property MemberAxislocation As AnalysisModel.AxisLocationEnum
	Get
	Set
Property Value
Type: AnalysisModel.AxisLocationEnum
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace